/*
 * GdbHandlerARM.cpp
 *
 *  Created on: 27 Mar 2015
 *      Author: podonoghue
 */

#include <string.h>
#include <time.h>
#include <errno.h>
#include "GdbHandler_ARM.h"
#include "ArmDefinitions.h"
#include "Names.h"
#include "signals.h"
#include "GdbBreakpoints_ARM.h"

GdbHandler *createARMGdbHandler(
      GdbHandler::GdbHandlerOwner    &owner,
      GdbInOut                       *gdbInOut,
      BdmInterfacePtr                 bdmInterface,
      DeviceInterfacePtr              deviceInterface,
      IGdbTty                        *tty) {
   return new GdbHandler_ARM(owner, gdbInOut, bdmInterface, deviceInterface, tty);
}

GdbHandler_ARM::GdbHandler_ARM(
      GdbHandlerOwner     &owner,
      GdbInOut            *gdbInOut,
      BdmInterfacePtr      bdmInterface,
      DeviceInterfacePtr   deviceInterface,
      IGdbTty              *tty) :
      GdbHandlerCommon(
            T_ARM,
            owner,
            gdbInOut,
            bdmInterface,
            deviceInterface,
            new GdbBreakpoints_ARM(bdmInterface),
            tty,
            DeviceData::resetHardware) {
   isKinetisDevice = false;
}

GdbHandler_ARM::~GdbHandler_ARM() {
}

// Target is LE == Native
//=============================
/**
 * Convert a 16-bit number between native <=> target endian
 *
 * @param data Value to convert
 *
 * @return Converted value
 */
uint16_t GdbHandler_ARM::targetToFromNative16(uint16_t data) {
   return data;
}

/**

      unsigned long  mdm_ap_status;
      USBDM_ErrorCode rc = bdmInterface->readCReg(ARM_CRegMDM_AP_Status, &mdm_ap_status);
      if (rc != BDM_RC_OK) {
         log.print("Failed to read mdm_ap_status, rc = %s(%d)\n", bdmInterface->getErrorString(rc), rc);
      }
      else {
         log.print("mdm_ap_status - %s(0x%08lX)\n", getMDM_APStatusName(mdm_ap_status), mdm_ap_status);
      }
   };

   // Try ARM debug halt method
   rc = bdmInterface->halt();
   if (rc != BDM_RC_OK) {
      log.print("Failed to halt target, rc = %s(%d)\n", bdmInterface->getErrorString(rc), rc);

      if (bdmInterface->connect() != BDM_RC_OK) {
         log.print("Re-connect failed\n");
      }
      else {
         log.print("Re-connect OK\n");
      }
      rc = bdmInterface->halt();
   }

   if ((rc != BDM_RC_OK) && isKinetisDevice) {
      // Use Kinetis specific debug (halt) method

      log.print("Halt failed, asserting MDM_AP_Control_Debug_Request\n");
      unsigned long  mdm_ap_control;

      do {
         readStatus();
         rc = bdmInterface->readCReg(ARM_CRegMDM_AP_Control, &mdm_ap_control);
         if (rc != BDM_RC_OK) {
            break;
         }
         log.print("Original mdm_ap_control - %s(0x%08lX)\n", getMDM_APControlName(mdm_ap_control), mdm_ap_control);
         mdm_ap_control &= ~(MDM_AP_Control_Debug_Request|MDM_AP_Control_VLLDBGACK);

         rc = bdmInterface->writeCReg(ARM_CRegMDM_AP_Control, mdm_ap_control|MDM_AP_Control_Debug_Request);
         if (rc != BDM_RC_OK) {
            break;
         }
         // Release Kinetis specific debug (halt) method
         rc = bdmInterface->writeCReg(ARM_CRegMDM_AP_Control, mdm_ap_control);
         if (rc != BDM_RC_OK) {
            break;
         }
      } while (false);
      if (rc != BDM_RC_OK) {
         log.print("Target access failed, rc = %s(%d)\n", bdmInterface->getErrorString(rc), rc);
      }
      readStatus();
   }
   if (rc != BDM_RC_OK) {
      log.error("Failed to halt target, rc = %s(%d)\n", bdmInterface->getErrorString(rc), rc);
      reportGdbPrintf(M_ERROR, "Failed to halt target - %s\n", bdmInterface->getErrorString(rc));
   }
   return rc;
}

/**
 * Get run state by polling target\n
 * Will attempt simple re-connect if necessary
 *
 * @return Status of target T_HALT, T_RUNNING etc
 *
 * @return T_NOCONNECTION Unable to connect to target - may be in LLSx or VLLSx.
 * @return T_RUNNING      Currently executing
 * @return T_HALT         Currently in debug halt
 * @return T_RESET        Currently in reset
 * @return T_WAIT         Currently in sleep (WAIT)
 * @return T_STOP         Currently in deep-sleep (STOP)
 * @return T_VLPR         Currently in low-power run (VLPR)
 * @return T_VLPW         Currently in low power sleep (VLPW)
 * @return T_VLPS         Currently in low power deep-sleep (VLPS)
 * @return T_LLSxEXIT     Running - Exited LLSx state
 * @return T_VLLSxEXIT    Running - Exited VLLSx state
 */
GdbHandler::GdbTargetStatus GdbHandler_ARM::getTargetStatus() {
   LOGGING;
   struct mdm_ap_control_t {
      union {
         uint32_t value;
         struct {
            /*  0 */ unsigned flash_erase:1;
            /*  1 */ unsigned debug_disable:1;
            /*  2 */ unsigned debug_req:1;
            /*  3 */ unsigned reset_req:1;
            /*  4 */ unsigned core_hold_reset:1;
            /*  5 */ unsigned vlls_debug_req:1;
            /*  6 */ unsigned vlls_debug_ack:1;
            /*  7 */ unsigned lls_vlls_stat_ack:1;
         };
      };
   };

   struct  mdm_ap_status_t {
      union {
         uint32_t value;
         struct {
            /*  0 */ unsigned mass_erase_ack:1;
            /*  1 */ unsigned flash_ready:1;
            /*  2 */ unsigned sys_security:1;
            /*  3 */ unsigned sys_reset_n:1;
            /*  4 */ unsigned :1;
            /*  5 */ unsigned mass_erase_en:1;
            /*  6 */ unsigned backdoor_en:1;
            /*  7 */ unsigned lp_enable:1;
            /*  8 */ unsigned very_low_power_mode:1;
            /*  9 */ unsigned lls_exit:1;
            /* 10 */ unsigned vllsx_exit:1;
            /* 11 */ unsigned :1;
            /* 12 */ unsigned :1;
            /* 13 */ unsigned :1;
            /* 14 */ unsigned :1;
            /* 15 */ unsigned :1;
            /* 16 */ unsigned halted:1;
            /* 17 */ unsigned sleepdeep:1;
            /* 18 */ unsigned sleep:1;
         };
      };
   };

   static GdbTargetStatus  lastStatus = GdbTargetStatus_NOCONNECTION;
   GdbTargetStatus         status     = GdbTargetStatus_NOCONNECTION;

   USBDM_ErrorCode         rc = BDM_RC_OK;
   do {
      if (isKinetisDevice) {
         /**
          *  Use Kinetis MDM_AP
          */
         unsigned long mdm_ap_status;
         rc = bdmInterface->readCReg(ARM_CRegMDM_AP_Status, &mdm_ap_status);
         if (rc != BDM_RC_OK) {
            log.error("Failed MDM_AP_Status read - No connection\n");
            status = GdbTargetStatus_NOCONNECTION;
            break;
         }

         unsigned long mdm_ap_control;
         rc = bdmInterface->readCReg(ARM_CRegMDM_AP_Control, &mdm_ap_control);

//         if (rc != BDM_RC_OK) {
//            log.print("Failed MDM_AP_Status read - Doing autoReconnect\n");
//            if (bdmInterface->connect() != BDM_RC_OK) {
//               log.print("Re-connect failed\n");
